; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	image1 - mode
	spectrograph0 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	Star7 - direction
	Star10 - direction
	GroundStation12 - direction
	GroundStation8 - direction
	Star2 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation11 - direction
	Star1 - direction
	Star9 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
	Star16 - direction
	Star17 - direction
	Planet18 - direction
	Phenomenon19 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star1)
	(supports instrument1 spectrograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation11)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 GroundStation8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star17)
	(supports instrument2 spectrograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 GroundStation5)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation11)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 image1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star9)
	(calibration_target instrument4 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
)
(:goal (and
	(pointing satellite0 Star15)
	(pointing satellite1 Star17)
	(have_image Phenomenon13 spectrograph0)
	(have_image Star14 image1)
	(have_image Star15 image1)
	(have_image Star16 image1)
	(have_image Star17 image1)
	(have_image Planet18 spectrograph0)
	(have_image Phenomenon19 image1)
))

)

; plan
1. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 9
2. (calibrate satellite1 instrument4 star1)
   added: (calibrated instrument4)
   goals met: 0 of 9
3. (turn_to satellite1 planet18 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet18)
   goals met: 0 of 9
4. (take_image satellite1 planet18 instrument4 spectrograph0)
   added: (have_image planet18 spectrograph0)
   goals met: 1 of 9
5. (turn_to satellite1 phenomenon19 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 phenomenon19)
   goals met: 1 of 9
6. (take_image satellite1 phenomenon19 instrument4 image1)
   added: (have_image phenomenon19 image1)
   goals met: 2 of 9
7. (turn_to satellite1 phenomenon13 phenomenon19)
   deleted: (pointing satellite1 phenomenon19)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 9
8. (turn_to satellite0 star15 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star15)
   goals met: 3 of 9
9. (take_image satellite1 phenomenon13 instrument4 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 4 of 9
10. (turn_to satellite1 star14 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star14)
   goals met: 4 of 9
11. (take_image satellite1 star14 instrument4 image1)
   added: (have_image star14 image1)
   goals met: 5 of 9
12. (turn_to satellite1 star15 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star15)
   goals met: 5 of 9
13. (take_image satellite1 star15 instrument4 image1)
   added: (have_image star15 image1)
   goals met: 6 of 9
14. (turn_to satellite1 star16 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star16)
   goals met: 6 of 9
15. (take_image satellite1 star16 instrument4 image1)
   added: (have_image star16 image1)
   goals met: 7 of 9
16. (turn_to satellite1 star17 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star17)
   goals met: 8 of 9
17. (take_image satellite1 star17 instrument4 image1)
   added: (have_image star17 image1)
   goals met: 9 of 9
